Microchip-MPLAB-Harmony/reference_apps/apps/pic32cz_ca80_cult/pic32cz_ca80_getting_started_ext/firmware/src/packs/PIC32CZ8110CA80208_DFP/component/sdmmc.h
/* -------- SDMMC_AESR : (SDMMC Offset: 0x54) ( R/ 8) ADMA Error Status -------- */
#define SDMMC_AESR_RESETVALUE                 _UINT8_(0x00)                                        /*  (SDMMC_AESR) ADMA Error Status  Reset Value */

#define SDMMC_AESR_ERRST_Pos                  _UINT8_(0)                                           /* (SDMMC_AESR) ADMA Error State Position */
#define SDMMC_AESR_ERRST_Msk                  (_UINT8_(0x3) << SDMMC_AESR_ERRST_Pos)               /* (SDMMC_AESR) ADMA Error State Mask */
#define SDMMC_AESR_ERRST(value)               (SDMMC_AESR_ERRST_Msk & (_UINT8_(value) << SDMMC_AESR_ERRST_Pos)) /* Assigment of value for ERRST in the SDMMC_AESR register */
#define   SDMMC_AESR_ERRST_STOP_Val           _UINT8_(0x0)                                         /* (SDMMC_AESR) ST_STOP (Stop DMA)  */
#define   SDMMC_AESR_ERRST_FDS_Val            _UINT8_(0x1)                                         /* (SDMMC_AESR) ST_FDS (Fetch Descriptor)  */
#define   SDMMC_AESR_ERRST_TFR_Val            _UINT8_(0x3)                                         /* (SDMMC_AESR) ST_TFR (Transfer Data)  */
#define SDMMC_AESR_ERRST_STOP                 (SDMMC_AESR_ERRST_STOP_Val << SDMMC_AESR_ERRST_Pos)  /* (SDMMC_AESR) ST_STOP (Stop DMA) Position  */
#define SDMMC_AESR_ERRST_FDS                  (SDMMC_AESR_ERRST_FDS_Val << SDMMC_AESR_ERRST_Pos)   /* (SDMMC_AESR) ST_FDS (Fetch Descriptor) Position  */
#define SDMMC_AESR_ERRST_TFR                  (SDMMC_AESR_ERRST_TFR_Val << SDMMC_AESR_ERRST_Pos)   /* (SDMMC_AESR) ST_TFR (Transfer Data) Position  */
#define SDMMC_AESR_LMIS_Pos                   _UINT8_(2)                                           /* (SDMMC_AESR) ADMA Length Mismatch Error Position */
#define SDMMC_AESR_LMIS_Msk                   (_UINT8_(0x1) << SDMMC_AESR_LMIS_Pos)                /* (SDMMC_AESR) ADMA Length Mismatch Error Mask */
#define SDMMC_AESR_LMIS(value)                (SDMMC_AESR_LMIS_Msk & (_UINT8_(value) << SDMMC_AESR_LMIS_Pos)) /* Assigment of value for LMIS in the SDMMC_AESR register */
#define   SDMMC_AESR_LMIS_NO_Val              _UINT8_(0x0)                                         /* (SDMMC_AESR) No Error  */
#define   SDMMC_AESR_LMIS_YES_Val             _UINT8_(0x1)                                         /* (SDMMC_AESR) Error  */
#define SDMMC_AESR_LMIS_NO                    (SDMMC_AESR_LMIS_NO_Val << SDMMC_AESR_LMIS_Pos)      /* (SDMMC_AESR) No Error Position  */
#define SDMMC_AESR_LMIS_YES                   (SDMMC_AESR_LMIS_YES_Val << SDMMC_AESR_LMIS_Pos)     /* (SDMMC_AESR) Error Position  */
#define SDMMC_AESR_Msk                        _UINT8_(0x07)                                        /* (SDMMC_AESR) Register Mask  */


/* -------- SDMMC_ASAR : (SDMMC Offset: 0x58) (R/W 32) ADMA System Address n -------- */
#define SDMMC_ASAR_RESETVALUE                 _UINT32_(0x00)                                       /*  (SDMMC_ASAR) ADMA System Address n  Reset Value */

#define SDMMC_ASAR_ADMASA_Pos                 _UINT32_(0)                                          /* (SDMMC_ASAR) ADMA System Address Position */
#define SDMMC_ASAR_ADMASA_Msk                 (_UINT32_(0xFFFFFFFF) << SDMMC_ASAR_ADMASA_Pos)      /* (SDMMC_ASAR) ADMA System Address Mask */
#define SDMMC_ASAR_ADMASA(value)              (SDMMC_ASAR_ADMASA_Msk & (_UINT32_(value) << SDMMC_ASAR_ADMASA_Pos)) /* Assigment of value for ADMASA in the SDMMC_ASAR register */
#define SDMMC_ASAR_Msk                        _UINT32_(0xFFFFFFFF)                                 /* (SDMMC_ASAR) Register Mask  */


/* -------- SDMMC_PVR : (SDMMC Offset: 0x60) (R/W 16) Preset Value n -------- */
#define SDMMC_PVR_RESETVALUE                  _UINT16_(0x00)                                       /*  (SDMMC_PVR) Preset Value n  Reset Value */

#define SDMMC_PVR_SDCLKFSEL_Pos               _UINT16_(0)                                          /* (SDMMC_PVR) SDCLK Frequency Select Value for Initialization Position */
#define SDMMC_PVR_SDCLKFSEL_Msk               (_UINT16_(0x3FF) << SDMMC_PVR_SDCLKFSEL_Pos)         /* (SDMMC_PVR) SDCLK Frequency Select Value for Initialization Mask */
#define SDMMC_PVR_SDCLKFSEL(value)            (SDMMC_PVR_SDCLKFSEL_Msk & (_UINT16_(value) << SDMMC_PVR_SDCLKFSEL_Pos)) /* Assigment of value for SDCLKFSEL in the SDMMC_PVR register */
#define SDMMC_PVR_CLKGSEL_Pos                 _UINT16_(10)                                         /* (SDMMC_PVR) Clock Generator Select Value for Initialization Position */
#define SDMMC_PVR_CLKGSEL_Msk                 (_UINT16_(0x1) << SDMMC_PVR_CLKGSEL_Pos)             /* (SDMMC_PVR) Clock Generator Select Value for Initialization Mask */
#define SDMMC_PVR_CLKGSEL(value)              (SDMMC_PVR_CLKGSEL_Msk & (_UINT16_(value) << SDMMC_PVR_CLKGSEL_Pos)) /* Assigment of value for CLKGSEL in the SDMMC_PVR register */
#define   SDMMC_PVR_CLKGSEL_DIV_Val           _UINT16_(0x0)                                        /* (SDMMC_PVR) Host Controller Ver2.00 Compatible Clock Generator (Divider)  */
#define   SDMMC_PVR_CLKGSEL_PROG_Val          _UINT16_(0x1)                                        /* (SDMMC_PVR) Programmable Clock Generator  */
#define SDMMC_PVR_CLKGSEL_DIV                 (SDMMC_PVR_CLKGSEL_DIV_Val << SDMMC_PVR_CLKGSEL_Pos) /* (SDMMC_PVR) Host Controller Ver2.00 Compatible Clock Generator (Divider) Position  */
#define SDMMC_PVR_CLKGSEL_PROG                (SDMMC_PVR_CLKGSEL_PROG_Val << SDMMC_PVR_CLKGSEL_Pos) /* (SDMMC_PVR) Programmable Clock Generator Position  */
#define SDMMC_PVR_DRVSEL_Pos                  _UINT16_(14)                                         /* (SDMMC_PVR) Driver Strength Select Value for Initialization Position */
#define SDMMC_PVR_DRVSEL_Msk                  (_UINT16_(0x3) << SDMMC_PVR_DRVSEL_Pos)              /* (SDMMC_PVR) Driver Strength Select Value for Initialization Mask */
#define SDMMC_PVR_DRVSEL(value)               (SDMMC_PVR_DRVSEL_Msk & (_UINT16_(value) << SDMMC_PVR_DRVSEL_Pos)) /* Assigment of value for DRVSEL in the SDMMC_PVR register */
#define   SDMMC_PVR_DRVSEL_B_Val              _UINT16_(0x0)                                        /* (SDMMC_PVR) Driver Type B is Selected  */
#define   SDMMC_PVR_DRVSEL_A_Val              _UINT16_(0x1)                                        /* (SDMMC_PVR) Driver Type A is Selected  */
#define   SDMMC_PVR_DRVSEL_C_Val              _UINT16_(0x2)                                        /* (SDMMC_PVR) Driver Type C is Selected  */
#define   SDMMC_PVR_DRVSEL_D_Val              _UINT16_(0x3)                                        /* (SDMMC_PVR) Driver Type D is Selected  */
#define SDMMC_PVR_DRVSEL_B                    (SDMMC_PVR_DRVSEL_B_Val << SDMMC_PVR_DRVSEL_Pos)     /* (SDMMC_PVR) Driver Type B is Selected Position  */
#define SDMMC_PVR_DRVSEL_A                    (SDMMC_PVR_DRVSEL_A_Val << SDMMC_PVR_DRVSEL_Pos)     /* (SDMMC_PVR) Driver Type A is Selected Position  */
#define SDMMC_PVR_DRVSEL_C                    (SDMMC_PVR_DRVSEL_C_Val << SDMMC_PVR_DRVSEL_Pos)     /* (SDMMC_PVR) Driver Type C is Selected Position  */
#define SDMMC_PVR_DRVSEL_D                    (SDMMC_PVR_DRVSEL_D_Val << SDMMC_PVR_DRVSEL_Pos)     /* (SDMMC_PVR) Driver Type D is Selected Position  */
#define SDMMC_PVR_Msk                         _UINT16_(0xC7FF)                                     /* (SDMMC_PVR) Register Mask  */


